# Pandas ==> It is an open source library that is used for handle data manipulations.`

In [13]:
# Data structure : 
# (1). Series (2). Data Frames

In [14]:
import pandas as pd

In [15]:
a = pd.Series([1,24,25,36])
a

0     1
1    24
2    25
3    36
dtype: int64

In [16]:
type(a)

pandas.core.series.Series

## (2). Dataframes

In [17]:
data = {
    "Emp_Id" : [1,2,3,4,5,6,7,8],
    "Name" : ['Sam', 'Gaurav', 'Aniket', 'Raj', 'Deepak', 'Kunal', 'Mohit', 'Eren'],
    "Department" : ['IT', 'HR', 'HR', 'IT', 'Operations', 'IT', 'Operations', 'IT'],
    "Working_Hour" : [8,9,7,8,8,7,9,8]
}

In [18]:
type(data)

dict

In [19]:
df = pd.DataFrame(data)
df

   Emp_Id    Name  Department  Working_Hour
0       1     Sam          IT             8
1       2  Gaurav          HR             9
2       3  Aniket          HR             7
3       4     Raj          IT             8
4       5  Deepak  Operations             8
5       6   Kunal          IT             7
6       7   Mohit  Operations             9
7       8    Eren          IT             8

In [20]:
df.head() #5 by default

   Emp_Id    Name  Department  Working_Hour
0       1     Sam          IT             8
1       2  Gaurav          HR             9
2       3  Aniket          HR             7
3       4     Raj          IT             8
4       5  Deepak  Operations             8

In [21]:
df.head(3)

   Emp_Id    Name Department  Working_Hour
0       1     Sam         IT             8
1       2  Gaurav         HR             9
2       3  Aniket         HR             7

In [22]:
df.tail()

   Emp_Id    Name  Department  Working_Hour
3       4     Raj          IT             8
4       5  Deepak  Operations             8
5       6   Kunal          IT             7
6       7   Mohit  Operations             9
7       8    Eren          IT             8

In [23]:
df.tail(3)

   Emp_Id   Name  Department  Working_Hour
5       6  Kunal          IT             7
6       7  Mohit  Operations             9
7       8   Eren          IT             8

In [24]:
df.sample(4) # It returns random-indexed rows.

   Emp_Id    Name  Department  Working_Hour
6       7   Mohit  Operations             9
7       8    Eren          IT             8
1       2  Gaurav          HR             9
5       6   Kunal          IT             7

In [25]:
df.describe() # It returns statically view of data.

        Emp_Id  Working_Hour
count  8.00000      8.000000
mean   4.50000      8.000000
std    2.44949      0.755929
min    1.00000      7.000000
25%    2.75000      7.750000
50%    4.50000      8.000000
75%    6.25000      8.250000
max    8.00000      9.000000

In [26]:
df.info() # Complete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Emp_Id        8 non-null      int64
 1   Name          8 non-null      object
 2   Department    8 non-null      object
 3   Working_Hour  8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 384.0+ bytes

In [27]:
df.to_csv("Emp_Info.csv")
df.to_csv("new_Emp_Info.csv", index = False)

In [28]:
df.to_excel("new2_Emp_Info.xlsx")

## How to read csv file into jupyter notebook

In [29]:
df = pd.read_csv("Emp_Info.csv")

In [30]:
df.head()

   Unnamed: 0  Emp_Id    Name  Department  Working_Hour
0           0       1     Sam          IT             8
1           1       2  Gaurav          HR             9
2           2       3  Aniket          HR             7
3           3       4     Raj          IT             8
4           4       5  Deepak  Operations             8

In [31]:
df['Department'].value_counts()

IT            4
HR            2
Operations    2
Name: Department, dtype: int64

In [32]:
data = {
    "Emp_Id" : [1,2,3,4,5,6,7,8],
    "Name" : ['Sam', 'Gaurav', 'Aniket', 'Raj', 'Deepak', 'Kunal', 'Mohit', 'Eren'],
    "Department" : ['IT', 'HR', 'HR', 'IT', 'Operations', 'IT', 'Operations', 'IT'],
    "Working_Hour" : [8,9,7,8,8,7,9,8]
}

In [33]:
df = pd.DataFrame(data)
df

   Emp_Id    Name  Department  Working_Hour
0       1     Sam          IT             8
1       2  Gaurav          HR             9
2       3  Aniket          HR             7
3       4     Raj          IT             8
4       5  Deepak  Operations             8
5       6   Kunal          IT             7
6       7   Mohit  Operations             9
7       8    Eren          IT             8

In [34]:
df['Name'][0] = 'Kriti'

C:\Users\Acer\AppData\Local\Temp\ipykernel_4872\1991129534.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'Kriti'

In [35]:
df.head()

   Emp_Id    Name  Department  Working_Hour
0       1   Kriti          IT             8
1       2  Gaurav          HR             9
2       3  Aniket          HR             7
3       4     Raj          IT             8
4       5  Deepak  Operations             8

In [36]:
df['Working_Hour'][3] = 7
df.head()

C:\Users\Acer\AppData\Local\Temp\ipykernel_4872\331438290.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Working_Hour'][3] = 7

   Emp_Id    Name  Department  Working_Hour
0       1   Kriti          IT             8
1       2  Gaurav          HR             9
2       3  Aniket          HR             7
3       4     Raj          IT             7
4       5  Deepak  Operations             8

In [38]:
df.loc[2:5, ["Name","Department"]]

     Name  Department
2  Aniket          HR
3     Raj          IT
4  Deepak  Operations
5   Kunal          IT

In [ ]:
df.iloc[2:5, [1,2]]

In [27]:
df.iloc[2:5, 1:4]

     Name  Department  Working_Hour
2  Aniket          HR             7
3     Raj          IT             7
4  Deepak  Operations             8

In [28]:
df['Name'][0] = None

C:\Users\Acer\AppData\Local\Temp\ipykernel_18116\698250460.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = None

In [29]:
df['Department'][3] = None
df['Department'][4] = None

C:\Users\Acer\AppData\Local\Temp\ipykernel_18116\59155726.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][3] = None
C:\Users\Acer\AppData\Local\Temp\ipykernel_18116\59155726.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][4] = None

In [30]:
df

   Emp_Id    Name  Department  Working_Hour
0       1    None          IT             8
1       2  Gaurav          HR             9
2       3  Aniket          HR             7
3       4     Raj        None             7
4       5  Deepak        None             8
5       6   Kunal          IT             7
6       7   Mohit  Operations             9
7       8    Eren          IT             8

In [31]:
df.isnull () # It will returns true if you have missing values otherwise return False

   Emp_Id   Name  Department  Working_Hour
0   False   True       False         False
1   False  False       False         False
2   False  False       False         False
3   False  False        True         False
4   False  False        True         False
5   False  False       False         False
6   False  False       False         False
7   False  False       False         False

In [41]:
df.isnull().sum()  # We can check Total missing values in our dataframe

Emp_Id          0
Name            0
Department      0
Working_Hour    0
dtype: int64

In [42]:
df = df.dropna() #remove rows containing none values
df

   Emp_Id    Name  Department  Working_Hour
0       1   Kriti          IT             8
1       2  Gaurav          HR             9
2       3  Aniket          HR             7
3       4     Raj          IT             7
4       5  Deepak  Operations             8
5       6   Kunal          IT             7
6       7   Mohit  Operations             9
7       8    Eren          IT             8